{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Infectious_Disease",
    "1": "Cardiology",
    "2": "Orthopedics_Surgery",
    "3": "Oncology",
    "4": "Pulmonology",
    "5": "Endocrinology",
    "6": "Gastroenterology",
    "7": "Neurology"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Cardiology": 1,
    "Endocrinology": 5,
    "Gastroenterology": 6,
    "Infectious_Disease": 0,
    "Neurology": 7,
    "Oncology": 3,
    "Orthopedics_Surgery": 2,
    "Pulmonology": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996,
  "xla_device": null
}
